MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX1025MTC128/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M4 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void SUPC_Handler                  ( void );
void RSTC_Handler                  ( void );
void RTC_Handler                   ( void );
void RTT_Handler                   ( void );
void DWDT0_Handler                 ( void );
void DWDT1_Handler                 ( void );
void PMC_Handler                   ( void );
void SEFC0_Handler                 ( void );
void SEFC1_Handler                 ( void );
void FLEXCOM0_Handler              ( void );
void FLEXCOM1_Handler              ( void );
void FLEXCOM2_Handler              ( void );
void FLEXCOM3_Handler              ( void );
void FLEXCOM4_Handler              ( void );
void FLEXCOM5_Handler              ( void );
void FLEXCOM6_Handler              ( void );
void FLEXCOM7_Handler              ( void );
void PIOA_Handler                  ( void );
void PIOA_SEC_Handler              ( void );
void PIOB_Handler                  ( void );
void PIOB_SEC_Handler              ( void );
void PIOC_Handler                  ( void );
void PIOC_SEC_Handler              ( void );
void QSPI_Handler                  ( void );
void ADC_Handler                   ( void );
void ACC_Handler                   ( void );
void IPC0_Handler                  ( void );
void SLCDC_Handler                 ( void );
void MEM2MEM0_Handler              ( void );
void TC0_CH0_Handler               ( void );
void TC0_CH1_Handler               ( void );
void TC0_CH2_Handler               ( void );
void TC1_CH0_Handler               ( void );
void TC1_CH1_Handler               ( void );
void TC1_CH2_Handler               ( void );
void TC2_CH0_Handler               ( void );
void TC2_CH1_Handler               ( void );
void TC2_CH2_Handler               ( void );
void TC0_C0SEC_Handler             ( void );
void TC0_C1SEC_Handler             ( void );
void TC0_C2SEC_Handler             ( void );
void TC1_C0SEC_Handler             ( void );
void TC1_C1SEC_Handler             ( void );
void TC1_C2SEC_Handler             ( void );
void TC2_C0SEC_Handler             ( void );
void TC2_C1SEC_Handler             ( void );
void TC2_C2SEC_Handler             ( void );
void AES_Handler                   ( void );
void AES_AESSEC_Handler            ( void );
void AESB_Handler                  ( void );
void AESB_AESBSEC_Handler          ( void );
void SHA_Handler                   ( void );
void SHA_SHASEC_Handler            ( void );
void TRNG_Handler                  ( void );
void TRNG_TRNGSEC_Handler          ( void );
void ICM_Handler                   ( void );
void ICM_ICMSEC_Handler            ( void );
void CPKCC_Handler                 ( void );
void MATRIX0_Handler               ( void );
void MATRIX1_Handler               ( void );
void SUPC_WKUP3_Handler            ( void );
void SUPC_WKUP4_Handler            ( void );
void SUPC_WKUP5_Handler            ( void );
void SUPC_WKUP6_Handler            ( void );
void SUPC_WKUP7_Handler            ( void );
void SUPC_WKUP8_Handler            ( void );
void SUPC_WKUP9_Handler            ( void );
void SUPC_WKUP10_Handler           ( void );
void SUPC_WKUP11_Handler           ( void );
void SUPC_WKUP12_Handler           ( void );
void SUPC_WKUP13_Handler           ( void );
void SUPC_WKUP14_Handler           ( void );
void SUPC_WKUP15_Handler           ( void );
void MEM2MEM1_Handler              ( void );
void TC3_CH0_Handler               ( void );
void TC3_CH1_Handler               ( void );
void TC3_CH2_Handler               ( void );
void TC3_C0SEC_Handler             ( void );
void TC3_C1SEC_Handler             ( void );
void TC3_C2SEC_Handler             ( void );
void PIOD_Handler                  ( void );
void PIOD_SEC_Handler              ( void );
void UART_Handler                  ( void );
void IPC1_Handler                  ( void );
void MCSPI_Handler                 ( void );
void PWM_Handler                   ( void );
void MATRIX2_Handler               ( void );
void MATRIX3_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M4 Processor and Core Peripherals */
#define __CM4_REV                     0x0001
#define __MPU_PRESENT                      1
#define __FPU_PRESENT                      1
#define __NVIC_PRIO_BITS                   4 /* Number of priority bits implemented in the NVIC                           */
#define __Vendor_SysTickConfig             0

/* CMSIS includes */
#include "core_cm4.h"
#if defined USE_CMSIS_INIT
// Note: Changed for MikroE implementation.
//#include "system_pic32cx1025mtc128.h"
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*         SOFTWARE PERIPHERAL API DEFINITIONS FOR PIC32CX1025MTC128          */
/* ************************************************************************** */
#include "component/acc.h"
#include "component/adc.h"
#include "component/aes.h"
#include "component/aesb.h"
#include "component/chipid.h"
#include "component/cmcc.h"
#include "component/cpkcc.h"
#include "component/dwdt.h"
#include "component/flexcom.h"
#include "component/fuses.h"
#include "component/gpbr.h"
#include "component/icm.h"
#include "component/ipc.h"
#include "component/matrix.h"
#include "component/mcspi.h"
#include "component/mem2mem.h"
#include "component/osc.h"
#include "component/pdc.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/pwm.h"
#include "component/qspi.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/sefc.h"
#include "component/sfr.h"
#include "component/sfrbu.h"
#include "component/sha.h"
#include "component/slcdc.h"
#include "component/supc.h"
#include "component/syscwp.h"
#include "component/tc.h"
#include "component/trng.h"
#include "component/uart.h"

/* ************************************************************************** */
/*                 INSTANCE DEFINITIONS FOR PIC32CX1025MTC128                 */
/* ************************************************************************** */
#include "instance/acc.h"
#include "instance/adc.h"
#include "instance/aes.h"
#include "instance/aesb.h"
#include "instance/chipid.h"
#include "instance/cmcc0.h"
#include "instance/cmcc1.h"
#include "instance/cpkcc.h"
#include "instance/dwdt.h"
#include "instance/flexcom0.h"
#include "instance/flexcom1.h"
#include "instance/flexcom2.h"
#include "instance/flexcom3.h"
#include "instance/flexcom4.h"
#include "instance/flexcom5.h"
#include "instance/flexcom6.h"
#include "instance/flexcom7.h"
#include "instance/fuses.h"
#include "instance/gpbr.h"
#include "instance/icm.h"
#include "instance/ipc0.h"
#include "instance/ipc1.h"
#include "instance/matrix0.h"
#include "instance/matrix1.h"
#include "instance/matrix2.h"
#include "instance/matrix3.h"
#include "instance/mcspi.h"
#include "instance/mem2mem0.h"
#include "instance/mem2mem1.h"
#include "instance/pio0.h"
#include "instance/pio1.h"
#include "instance/pioa.h"
#include "instance/piob.h"
#include "instance/pioc.h"
#include "instance/piod.h"
#include "instance/pmc.h"
#include "instance/pwm.h"
#include "instance/qspi.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/rtt.h"
#include "instance/sefc0.h"
#include "instance/sefc1.h"
#include "instance/sfr.h"
#include "instance/sfrbu.h"
#include "instance/sha.h"
#include "instance/slcdc.h"
#include "instance/sram1.h"
#include "instance/supc.h"
#include "instance/syscwp.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/trng.h"
#include "instance/uart.h"

/* ************************************************************************** */
/*              PERIPHERAL ID DEFINITIONS FOR PIC32CX1025MTC128               */
/* ************************************************************************** */
#define ID_SUPC          (  0) /* Supply Controller (SUPC) */
#define ID_RSTC          (  1) /* Reset Controller (RSTC) */
#define ID_RTC           (  2) /* Real-time Clock (RTC) */
#define ID_RTT           (  3) /* Real-time Timer (RTT) */
#define ID_DWDT          (  4) /* Dual Watchdog Timer (DWDT) */
#define ID_PMC           (  6) /* Power Management Controller (PMC) */
#define ID_SEFC0         (  7) /* Secure Embedded Flash Controller (SEFC0) */
#define ID_SEFC1         (  8) /* Secure Embedded Flash Controller (SEFC1) */
#define ID_FLEXCOM0      (  9) /* Flexible Serial Communication (FLEXCOM0) */
#define ID_FLEXCOM1      ( 10) /* Flexible Serial Communication (FLEXCOM1) */
#define ID_FLEXCOM2      ( 11) /* Flexible Serial Communication (FLEXCOM2) */
#define ID_FLEXCOM3      ( 12) /* Flexible Serial Communication (FLEXCOM3) */
#define ID_FLEXCOM4      ( 13) /* Flexible Serial Communication (FLEXCOM4) */
#define ID_FLEXCOM5      ( 14) /* Flexible Serial Communication (FLEXCOM5) */
#define ID_FLEXCOM6      ( 15) /* Flexible Serial Communication (FLEXCOM6) */
#define ID_FLEXCOM7      ( 16) /* Flexible Serial Communication (FLEXCOM7) */
#define ID_PIOA          ( 17) /* Parallel Input/Output Controller (PIOA) */
#define ID_PIOA_SEC      ( 18) /* Parallel Input/Output Controller (PIOA_SEC) */
#define ID_PIOB          ( 19) /* Parallel Input/Output Controller (PIOB) */
#define ID_PIOB_SEC      ( 20) /* Parallel Input/Output Controller (PIOB_SEC) */
#define ID_PIOC          ( 21) /* Parallel Input/Output Controller (PIOC) */
#define ID_PIOC_SEC      ( 22) /* Parallel Input/Output Controller (PIOC_SEC) */
#define ID_QSPI          ( 23) /* Quad Serial Peripheral Interface (QSPI) */
#define ID_ADC           ( 24) /* Analog-to-Digital Converter (ADC) */
#define ID_ACC           ( 25) /* Analog Comparator Controller (ACC) */
#define ID_IPC0          ( 28) /* Inter-processor Communication (IPC0) */
#define ID_SLCDC         ( 29) /* Segment LCD Controller (SLCDC) */
#define ID_MEM2MEM0      ( 30) /* Memory to Memory (MEM2MEM0) */
#define ID_TC0_CHANNEL0  ( 31) /* Timer Counter (TC0_CHANNEL0) */
#define ID_TC0_CHANNEL1  ( 32) /* Timer Counter (TC0_CHANNEL1) */
#define ID_TC0_CHANNEL2  ( 33) /* Timer Counter (TC0_CHANNEL2) */
#define ID_TC1_CHANNEL0  ( 34) /* Timer Counter (TC1_CHANNEL0) */
#define ID_TC1_CHANNEL1  ( 35) /* Timer Counter (TC1_CHANNEL1) */
#define ID_TC1_CHANNEL2  ( 36) /* Timer Counter (TC1_CHANNEL2) */
#define ID_TC2_CHANNEL0  ( 37) /* Timer Counter (TC2_CHANNEL0) */
#define ID_TC2_CHANNEL1  ( 38) /* Timer Counter (TC2_CHANNEL1) */
#define ID_TC2_CHANNEL2  ( 39) /* Timer Counter (TC2_CHANNEL2) */
#define ID_TC0_C0SEC     ( 40) /* Timer Counter (TC0_C0SEC) */
#define ID_TC0_C1SEC     ( 41) /* Timer Counter (TC0_C1SEC) */
#define ID_TC0_C2SEC     ( 42) /* Timer Counter (TC0_C2SEC) */
#define ID_TC1_C0SEC     ( 43) /* Timer Counter (TC1_C0SEC) */
#define ID_TC1_C1SEC     ( 44) /* Timer Counter (TC1_C1SEC) */
#define ID_TC1_C2SEC     ( 45) /* Timer Counter (TC1_C2SEC) */
#define ID_TC2_C0SEC     ( 46) /* Timer Counter (TC2_C0SEC) */
#define ID_TC2_C1SEC     ( 47) /* Timer Counter (TC2_C1SEC) */
#define ID_TC2_C2SEC     ( 48) /* Timer Counter (TC2_C2SEC) */
#define ID_AES           ( 49) /* Advanced Encryption Standard (AES) */
#define ID_AES_AESSEC    ( 50) /* Advanced Encryption Standard (AES_AESSEC) */
#define ID_AESB          ( 51) /* Advanced Encryption Standard Bridge (AESB) */
#define ID_AESB_AESBSEC  ( 52) /* Advanced Encryption Standard Bridge (AESB_AESBSEC) */
#define ID_SHA           ( 53) /* Secure Hash Algorithm (SHA) */
#define ID_SHA_SHASEC    ( 54) /* Secure Hash Algorithm (SHA_SHASEC) */
#define ID_TRNG          ( 55) /* True Random Number Generator (TRNG) */
#define ID_TRNG_TRNGSEC  ( 56) /* True Random Number Generator (TRNG_TRNGSEC) */
#define ID_ICM           ( 57) /* Integrity Check Monitor (ICM) */
#define ID_ICM_ICMSEC    ( 58) /* Integrity Check Monitor (ICM_ICMSEC) */
#define ID_CPKCC         ( 59) /* Classic Public Key Cryptography Controller (CPKCC) */
#define ID_MATRIX0       ( 60) /* AHB Bus Matrix (MATRIX0) */
#define ID_MATRIX1       ( 61) /* AHB Bus Matrix (MATRIX1) */
#define ID_SUPC_WKUP3    ( 62) /* Supply Controller (SUPC_WKUP3) */
#define ID_SUPC_WKUP4    ( 63) /* Supply Controller (SUPC_WKUP4) */
#define ID_SUPC_WKUP5    ( 64) /* Supply Controller (SUPC_WKUP5) */
#define ID_SUPC_WKUP6    ( 65) /* Supply Controller (SUPC_WKUP6) */
#define ID_SUPC_WKUP7    ( 66) /* Supply Controller (SUPC_WKUP7) */
#define ID_SUPC_WKUP8    ( 67) /* Supply Controller (SUPC_WKUP8) */
#define ID_SUPC_WKUP9    ( 68) /* Supply Controller (SUPC_WKUP9) */
#define ID_SUPC_WKUP10   ( 69) /* Supply Controller (SUPC_WKUP10) */
#define ID_SUPC_WKUP11   ( 70) /* Supply Controller (SUPC_WKUP11) */
#define ID_SUPC_WKUP12   ( 71) /* Supply Controller (SUPC_WKUP12) */
#define ID_SUPC_WKUP13   ( 72) /* Supply Controller (SUPC_WKUP13) */
#define ID_SUPC_WKUP14   ( 73) /* Supply Controller (SUPC_WKUP14) */
#define ID_SUPC_WKUP15   ( 74) /* Supply Controller (SUPC_WKUP15) */
#define ID_MEM2MEM1      ( 78) /* Memory to Memory (MEM2MEM1) */
#define ID_TC3_CHANNEL0  ( 79) /* Timer Counter (TC3_CHANNEL0) */
#define ID_TC3_CHANNEL1  ( 80) /* Timer Counter (TC3_CHANNEL1) */
#define ID_TC3_CHANNEL2  ( 81) /* Timer Counter (TC3_CHANNEL2) */
#define ID_TC3_C0SEC     ( 82) /* Timer Counter (TC3_C0SEC) */
#define ID_TC3_C1SEC     ( 83) /* Timer Counter (TC3_C1SEC) */
#define ID_TC3_C2SEC     ( 84) /* Timer Counter (TC3_C2SEC) */
#define ID_PIOD          ( 85) /* Parallel Input/Output Controller (PIOD) */
#define ID_PIOD_SEC      ( 86) /* Parallel Input/Output Controller (PIOD_SEC) */
#define ID_UART          ( 87) /* Universal Asynchronous Receiver Transmitter (UART) */
#define ID_IPC1          ( 88) /* Inter-processor Communication (IPC1) */
#define ID_MCSPI         ( 89) /* Multi Channel Serial Peripheral Interface (MCSPI) */
#define ID_PWM           ( 90) /* Pulse Width Modulation Controller (PWM) */
#define ID_SRAM1         ( 91) /* Metrology Core RAM (FLEXRAM 1 2) (SRAM1) */
#define ID_MATRIX2       ( 94) /* AHB Bus Matrix (MATRIX2) */
#define ID_MATRIX3       ( 95) /* AHB Bus Matrix (MATRIX3) */

#define ID_PERIPH_MAX    ( 95) /* Number of peripheral IDs */

/* ************************************************************************** */
/*        REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CX1025MTC128        */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define ACC_REGS                         ((acc_registers_t*)0x40028000)                /* ACC Registers Address        */
#define ADC_REGS                         ((adc_registers_t*)0x40024000)                /* ADC Registers Address        */
#define AES_REGS                         ((aes_registers_t*)0x44000000)                /* AES Registers Address        */
#define AESB_REGS                        ((aesb_registers_t*)0x44004000)               /* AESB Registers Address       */
#define CHIPID_REGS                      ((chipid_registers_t*)0x40050200)             /* CHIPID Registers Address     */
#define CMCC0_REGS                       ((cmcc_registers_t*)0x46008000)               /* CMCC0 Registers Address      */
#define CMCC1_REGS                       ((cmcc_registers_t*)0x4600c000)               /* CMCC1 Registers Address      */
#define CPKCC_REGS                       ((cpkcc_registers_t*)0x46000000)              /* CPKCC Registers Address      */
#define DWDT_REGS                        ((dwdt_registers_t*)0x40052000)               /* DWDT Registers Address       */
#define FLEXCOM0_REGS                    ((flexcom_registers_t*)0x40000000)            /* FLEXCOM0 Registers Address   */
#define FLEXCOM1_REGS                    ((flexcom_registers_t*)0x40004000)            /* FLEXCOM1 Registers Address   */
#define FLEXCOM2_REGS                    ((flexcom_registers_t*)0x40008000)            /* FLEXCOM2 Registers Address   */
#define FLEXCOM3_REGS                    ((flexcom_registers_t*)0x4000c000)            /* FLEXCOM3 Registers Address   */
#define FLEXCOM4_REGS                    ((flexcom_registers_t*)0x40010000)            /* FLEXCOM4 Registers Address   */
#define FLEXCOM5_REGS                    ((flexcom_registers_t*)0x40014000)            /* FLEXCOM5 Registers Address   */
#define FLEXCOM6_REGS                    ((flexcom_registers_t*)0x40018000)            /* FLEXCOM6 Registers Address   */
#define FLEXCOM7_REGS                    ((flexcom_registers_t*)0x4001c000)            /* FLEXCOM7 Registers Address   */
#define GPBR_REGS                        ((gpbr_registers_t*)0x40053060)               /* GPBR Registers Address       */
#define ICM_REGS                         ((icm_registers_t*)0x44010000)                /* ICM Registers Address        */
#define IPC0_REGS                        ((ipc_registers_t*)0x4002c000)                /* IPC0 Registers Address       */
#define IPC1_REGS                        ((ipc_registers_t*)0x48014000)                /* IPC1 Registers Address       */
#define MATRIX0_REGS                     ((matrix_registers_t*)0x46004000)             /* MATRIX0 Registers Address    */
#define MATRIX1_REGS                     ((matrix_registers_t*)0x40044000)             /* MATRIX1 Registers Address    */
#define MATRIX2_REGS                     ((matrix_registers_t*)0x4a000000)             /* MATRIX2 Registers Address    */
#define MATRIX3_REGS                     ((matrix_registers_t*)0x48020000)             /* MATRIX3 Registers Address    */
#define MCSPI_REGS                       ((mcspi_registers_t*)0x48018000)              /* MCSPI Registers Address      */
#define MEM2MEM0_REGS                    ((mem2mem_registers_t*)0x40034000)            /* MEM2MEM0 Registers Address   */
#define MEM2MEM1_REGS                    ((mem2mem_registers_t*)0x48004000)            /* MEM2MEM1 Registers Address   */
#define PIO0_REGS                        ((pio_registers_t*)0x40048000)                /* PIO0 Registers Address       */
#define PIO1_REGS                        ((pio_registers_t*)0x4800c000)                /* PIO1 Registers Address       */
#define PMC_REGS                         ((pmc_registers_t*)0x46800000)                /* PMC Registers Address        */
#define PWM_REGS                         ((pwm_registers_t*)0x4801c000)                /* PWM Registers Address        */
#define QSPI_REGS                        ((qspi_registers_t*)0x40020000)               /* QSPI Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0x40053000)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40053100)                /* RTC Registers Address        */
#define RTT_REGS                         ((rtt_registers_t*)0x40053020)                /* RTT Registers Address        */
#define SEFC0_REGS                       ((sefc_registers_t*)0x460e0000)               /* SEFC0 Registers Address      */
#define SEFC1_REGS                       ((sefc_registers_t*)0x460e0200)               /* SEFC1 Registers Address      */
#define SFR_REGS                         ((sfr_registers_t*)0x40050400)                /* SFR Registers Address        */
#define SFRBU_REGS                       ((sfrbu_registers_t*)0x40050600)              /* SFRBU Registers Address      */
#define SHA_REGS                         ((sha_registers_t*)0x44008000)                /* SHA Registers Address        */
#define SLCDC_REGS                       ((slcdc_registers_t*)0x40030000)              /* SLCDC Registers Address      */
#define SUPC_REGS                        ((supc_registers_t*)0x400531d0)               /* SUPC Registers Address       */
#define SYSCWP_REGS                      ((syscwp_registers_t*)0x400531a0)             /* SYSCWP Registers Address     */
#define TC0_REGS                         ((tc_registers_t*)0x40038000)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x4003c000)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x40040000)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x48008000)                 /* TC3 Registers Address        */
#define TRNG_REGS                        ((trng_registers_t*)0x4400c000)               /* TRNG Registers Address       */
#define UART_REGS                        ((uart_registers_t*)0x48010000)               /* UART Registers Address       */
#define GPNVMBITS_REGS                   ((fuses_gpnvmbits_registers_t*)0x00000000)    /* FUSES Registers Address      */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

